<template>
  <div class="description">
    <h1>Chapter</h1>
    一个毫无意义的看着像素点们争夺地盘的网站。
    <h2>游戏说明</h2>
    1. 每个成员代表一个颜色，在方圆为50平方光年的荒芜区域进行资源争夺。<br/>
    2. 每一个小点就是1平方光年。 开拓一个荒芜区域，资源增加1万亿吨。<br/>
    3. 占领他人一个区域，资源增加10万亿吨。 被占领一个区域，资源减少10万亿吨。<br/>
    4. %，为0.1秒进行一次随机探索。当负债资源时，开拓周期会变大，探索速率会降低，到达最大开拓周期后停止争夺。<br/>
    5. 每当有一个成员停止争夺时，将会有一个随机成员获得新的随机探索序列。如果获得探索序列的成员之前是停止争夺的，则继续开始争夺，并资源清零。<br/>
    6. 当某位成员达到最大资源或场上剩下一位成员争夺时，游戏结束，该成员获胜。
    <h2>控制说明</h2>
    <h3>新增成员</h3>
    在右边【+新成员】中添加新成员。填写两个内容，一个是名称，一个是对应的颜色。颜色可以从取色其中直接取。<br/>
    同时，也可以直接通过预设成员直接添加新成员。预设成员是在代码里面提前写好的。<br/>
    删除成员时、删除的成员会进入预设成员列表中，方便回收。<br/>
    <h3>参数配置</h3>
    通过右上角两个滑块，可以直接调整最大获胜资源和最大扩展周期，从而改变整个游戏的周期节奏。<br/>
    <h3>按钮</h3>
    下方点击【开始】即开始一轮新的游戏。<br/>
    点击【停止】即暂停整个游戏。<br>
    点击【继续】则继续整个游戏。<br>
    <h2>源码说明</h2>
    核心功能算法写在App中。 <br/>
    Area用于绘制像素点。 <br/>
    Config用于控制配置。<br/>
    Description即游戏说明。 <br/>
    Message为游戏日志。 <br/>
    Rank为游戏排名。<br/>
    area.js存放需要被绘图的一些静态的东西。 <br/>
    member.js存放成员类。<br/>
    presets.js存放预设成员配置<br/>
    <h2>注意</h2>
    1. 不同的成员尽量使用不同的颜色。<br/>
    2. 至少需要两名成员才能开始游戏。 <br/>
    3. 停止的时候如果直接点击开始会直接重新开始游戏。<br/>
    4. 若修改了任何配置，必须要在下一轮游戏中才会生效。<br/>
  </div>
</template>
